music_app/app/models/user.rb

    def self.find_by_credentials(email, password)
        u = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "saveajay5@gmail.com"], ["LIMIT", 1]]

    def reset_session_token!
        # use class helper method to create a new session_token
        self.session_token = self.class.generate_session_token
        self.save!          # save user so new session_token gets updated in database
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-04-04 23:27:19.731990"], ["session_token", "C2_x3IY7WAlJmIvxKAGTHA"], ["id", 1]]